Robotzade/Rednova-Family/hardware/rednova/avr/boards.txt
##############################################################
# Rednova Family
# MCU: ATmega32U4
# Clock: 16 MHz
# Core and pin mapping: Arduino Leonardo
##############################################################

rednova_v2.name=Rednova V2
rednova_v2.upload.tool=rednova_avrdude
rednova_v2.upload.tool.default=rednova_avrdude
rednova_v2.upload.expected_app_pid=0002
rednova_v2.upload.expected_boot_pid=0001
rednova_v2.upload.expected_boot_vid=1209
rednova_v2.upload.old_boot=false
rednova_v2.upload.expected_vid=1209
rednova_v2.upload.expected_board=Rednova V2
rednova_v2.upload.expected_model=V2
rednova_v2.upload.protocol=avr109
rednova_v2.upload.maximum_size=28672
rednova_v2.upload.maximum_data_size=2560
rednova_v2.upload.speed=57600
rednova_v2.upload.disable_flushing=true
rednova_v2.upload.use_1200bps_touch=false
rednova_v2.upload.wait_for_upload_port=false
rednova_v2.bootloader.tool=avrdude
rednova_v2.bootloader.tool.default=avrdude
rednova_v2.bootloader.tool.serial=avrdude
rednova_v2.bootloader.low_fuses=0xff
rednova_v2.bootloader.high_fuses=0xd8
rednova_v2.bootloader.extended_fuses=0xcb
rednova_v2.bootloader.file=caterina/Caterina-RednovaV2.hex
rednova_v2.bootloader.identity_file=identity/RednovaV2.eep
rednova_v2.bootloader.unlock_bits=0x3F
rednova_v2.bootloader.lock_bits=0x2F
rednova_v2.build.mcu=atmega32u4
rednova_v2.build.f_cpu=16000000L
rednova_v2.build.vid=0x1209
rednova_v2.build.pid=0x0002
rednova_v2.build.usb_product="Rednova V2"
rednova_v2.build.board=REDNOVA_V2
rednova_v2.build.core=arduino:arduino
rednova_v2.build.variant=arduino:leonardo
rednova_v2.build.extra_flags={build.usb_flags} -DREDNOVA_BOARD_V2=1
rednova_v2.upload_port.0.vid=0x1209
rednova_v2.upload_port.0.pid=0x0001
rednova_v2.upload_port.1.vid=0x1209
rednova_v2.upload_port.1.pid=0x0002

##############################################################
# Rednova Micro
# Two DIP switches: SW1=D15, SW2=D16
##############################################################

rednova_micro.name=Rednova Micro
rednova_micro.upload.tool=rednova_avrdude
rednova_micro.upload.tool.default=rednova_avrdude
rednova_micro.upload.expected_app_pid=0004
rednova_micro.upload.expected_boot_pid=0003
rednova_micro.upload.expected_boot_vid=1209
rednova_micro.upload.old_boot=false
rednova_micro.upload.expected_vid=1209
rednova_micro.upload.expected_board=Rednova Micro
rednova_micro.upload.expected_model=MICRO
rednova_micro.upload.protocol=avr109
rednova_micro.upload.maximum_size=28672
rednova_micro.upload.maximum_data_size=2560
rednova_micro.upload.speed=57600
rednova_micro.upload.disable_flushing=true
rednova_micro.upload.use_1200bps_touch=false
rednova_micro.upload.wait_for_upload_port=false
rednova_micro.bootloader.tool=avrdude
rednova_micro.bootloader.tool.default=avrdude
rednova_micro.bootloader.tool.serial=avrdude
rednova_micro.bootloader.low_fuses=0xff
rednova_micro.bootloader.high_fuses=0xd8
rednova_micro.bootloader.extended_fuses=0xcb
rednova_micro.bootloader.file=caterina/Caterina-RednovaMicro.hex
rednova_micro.bootloader.identity_file=identity/RednovaMicro.eep
rednova_micro.bootloader.unlock_bits=0x3F
rednova_micro.bootloader.lock_bits=0x2F
rednova_micro.build.mcu=atmega32u4
rednova_micro.build.f_cpu=16000000L
rednova_micro.build.vid=0x1209
rednova_micro.build.pid=0x0004
rednova_micro.build.usb_product="Rednova Micro"
rednova_micro.build.board=REDNOVA_MICRO
rednova_micro.build.core=arduino:arduino
rednova_micro.build.variant=arduino:leonardo
rednova_micro.build.extra_flags={build.usb_flags} -DREDNOVA_BOARD_MICRO=1
rednova_micro.upload_port.0.vid=0x1209
rednova_micro.upload_port.0.pid=0x0003
rednova_micro.upload_port.1.vid=0x1209
rednova_micro.upload_port.1.pid=0x0004

##############################################################
# Old Arduino Leonardo bootloader compatibility
##############################################################

rednova_v2_old_boot.name=Rednova V2 (Old Boot Leonardo)
rednova_v2_old_boot.upload.tool=rednova_avrdude
rednova_v2_old_boot.upload.tool.default=rednova_avrdude
rednova_v2_old_boot.upload.expected_vid=1209
rednova_v2_old_boot.upload.expected_app_pid=0002
rednova_v2_old_boot.upload.expected_boot_pid=0036
rednova_v2_old_boot.upload.expected_boot_vid=2341
rednova_v2_old_boot.upload.old_boot=true
rednova_v2_old_boot.upload.expected_board=Rednova V2 (Old Boot Leonardo)
rednova_v2_old_boot.upload.expected_model=V2
rednova_v2_old_boot.upload.protocol=avr109
rednova_v2_old_boot.upload.maximum_size=28672
rednova_v2_old_boot.upload.maximum_data_size=2560
rednova_v2_old_boot.upload.speed=57600
rednova_v2_old_boot.upload.disable_flushing=true
rednova_v2_old_boot.upload.use_1200bps_touch=false
rednova_v2_old_boot.upload.wait_for_upload_port=false
rednova_v2_old_boot.bootloader.tool=avrdude
rednova_v2_old_boot.bootloader.tool.default=avrdude
rednova_v2_old_boot.bootloader.tool.serial=avrdude
rednova_v2_old_boot.bootloader.low_fuses=0xff
rednova_v2_old_boot.bootloader.high_fuses=0xd8
rednova_v2_old_boot.bootloader.extended_fuses=0xcb
rednova_v2_old_boot.bootloader.file=caterina/Caterina-Leonardo.hex
rednova_v2_old_boot.bootloader.identity_file=identity/RednovaV2.eep
rednova_v2_old_boot.bootloader.unlock_bits=0x3F
rednova_v2_old_boot.bootloader.lock_bits=0x2F
rednova_v2_old_boot.build.mcu=atmega32u4
rednova_v2_old_boot.build.f_cpu=16000000L
rednova_v2_old_boot.build.vid=0x1209
rednova_v2_old_boot.build.pid=0x0002
rednova_v2_old_boot.build.usb_product="Rednova V2"
rednova_v2_old_boot.build.board=REDNOVA_V2_OLD_BOOT
rednova_v2_old_boot.build.core=arduino:arduino
rednova_v2_old_boot.build.variant=arduino:leonardo
rednova_v2_old_boot.build.extra_flags={build.usb_flags} -DREDNOVA_BOARD_V2=1 -DREDNOVA_OLD_BOOT_LEONARDO=1
rednova_v2_old_boot.upload_port.0.vid=0x2341
rednova_v2_old_boot.upload_port.0.pid=0x0036
rednova_v2_old_boot.upload_port.1.vid=0x2341
rednova_v2_old_boot.upload_port.1.pid=0x8036
rednova_v2_old_boot.upload_port.2.vid=0x1209
rednova_v2_old_boot.upload_port.2.pid=0x0002

rednova_micro_old_boot.name=Rednova Micro (Old Boot Leonardo)
rednova_micro_old_boot.upload.tool=rednova_avrdude
rednova_micro_old_boot.upload.tool.default=rednova_avrdude
rednova_micro_old_boot.upload.expected_vid=1209
rednova_micro_old_boot.upload.expected_app_pid=0004
rednova_micro_old_boot.upload.expected_boot_pid=0036
rednova_micro_old_boot.upload.expected_boot_vid=2341
rednova_micro_old_boot.upload.old_boot=true
rednova_micro_old_boot.upload.expected_board=Rednova Micro (Old Boot Leonardo)
rednova_micro_old_boot.upload.expected_model=MICRO
rednova_micro_old_boot.upload.protocol=avr109
rednova_micro_old_boot.upload.maximum_size=28672
rednova_micro_old_boot.upload.maximum_data_size=2560
rednova_micro_old_boot.upload.speed=57600
rednova_micro_old_boot.upload.disable_flushing=true
rednova_micro_old_boot.upload.use_1200bps_touch=false
rednova_micro_old_boot.upload.wait_for_upload_port=false
rednova_micro_old_boot.bootloader.tool=avrdude
rednova_micro_old_boot.bootloader.tool.default=avrdude
rednova_micro_old_boot.bootloader.tool.serial=avrdude
rednova_micro_old_boot.bootloader.low_fuses=0xff
rednova_micro_old_boot.bootloader.high_fuses=0xd8
rednova_micro_old_boot.bootloader.extended_fuses=0xcb
rednova_micro_old_boot.bootloader.file=caterina/Caterina-Leonardo.hex
rednova_micro_old_boot.bootloader.identity_file=identity/RednovaMicro.eep
rednova_micro_old_boot.bootloader.unlock_bits=0x3F
rednova_micro_old_boot.bootloader.lock_bits=0x2F
rednova_micro_old_boot.build.mcu=atmega32u4
rednova_micro_old_boot.build.f_cpu=16000000L
rednova_micro_old_boot.build.vid=0x1209
rednova_micro_old_boot.build.pid=0x0004
rednova_micro_old_boot.build.usb_product="Rednova Micro"
rednova_micro_old_boot.build.board=REDNOVA_MICRO_OLD_BOOT
rednova_micro_old_boot.build.core=arduino:arduino
rednova_micro_old_boot.build.variant=arduino:leonardo
rednova_micro_old_boot.build.extra_flags={build.usb_flags} -DREDNOVA_BOARD_MICRO=1 -DREDNOVA_OLD_BOOT_LEONARDO=1
rednova_micro_old_boot.upload_port.0.vid=0x2341
rednova_micro_old_boot.upload_port.0.pid=0x0036
rednova_micro_old_boot.upload_port.1.vid=0x2341
rednova_micro_old_boot.upload_port.1.pid=0x8036
rednova_micro_old_boot.upload_port.2.vid=0x1209
rednova_micro_old_boot.upload_port.2.pid=0x0004
